Revit 2027 API
MEPAnalyticalModelData.GetNodeByIndex Method
 Gets the specified analytical node.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPAnalyticalNode GetNodeByIndex(
	int index
)
Public Function GetNodeByIndex (
	index As Integer
) As MEPAnalyticalNode
public:
MEPAnalyticalNode^ GetNodeByIndex(
	int index
)
member GetNodeByIndex :
        index : int -> MEPAnalyticalNode
Parameters
index Int32
 The node index number by their storing sequence, starting from 0.
Return Value
MEPAnalyticalNode
 The returned analytical node.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The index must range from 0 to GetNumberOfNodes()-1.
See Also
Reference
MEPAnalyticalModelData Class
Autodesk.Revit.DB.Analysis Namespace